const BMI = {
  range: [0, 18.5, 23.0, 25.0, 30.0],
  comment: [
    'น้ำหนักต่ำกว่าเกณฑ์',
    'สมส่วน',
    'น้ำหนักเกิน',
    'โรคอ้วน',
    'โรคอ้วนอันตราย'
  ]
}

const HEART_RATE = {
  age: [18, 26, 36, 46, 56, 66],
  male: [
    [49, 56, 62, 66, 70, 74, 82],
    [50, 55, 62, 66, 71, 75, 82],
    [50, 57, 62, 66, 71, 75, 83],
    [50, 58, 64, 68, 72, 77, 84],
    [51, 57, 62, 68, 72, 76, 82],
    [50, 56, 62, 66, 70, 74, 80]
  ],
  female: [
    [54, 61, 66, 70, 74, 79, 85],
    [54, 60, 65, 69, 73, 77, 83],
    [54, 60, 65, 69, 73, 77, 83],
    [54, 61, 66, 70, 74, 78, 84],
    [54, 60, 65, 69, 74, 78, 84],
    [54, 60, 65, 67, 73, 77, 85]
  ],
  comment: [
    'สมรรถภาพดีเยี่ยม',
    'สมรรถภาพดีมาก',
    'สมรรถภาพดี',
    'สมรรถภาพดีกว่าปกติ',
    'สมรรถภาพปกติ',
    'สมรรถภาพต่ำกว่าปกติ',
    'สมรรถภาพต่ำ'
  ]
};

const OXYGEN = {
  range: [0, 92],
  comment: [
    'ปกติ ไม่มีภาวะพร่องออกซิเจน',
    'มีปัญหาด้านภาวะพร่องออกซิเจน'
  ]
}

const TEMPERATURE = {
  range: [0, 37.0, 39.0, 39.6],
  comment: [
    'ปกติ',
    'ไข้ต่ำ',
    'ไข้ปานกลาง',
    'ไข้สูง'
  ]
}

export default {
  BMI,
  HEART_RATE,
  OXYGEN,
  TEMPERATURE
}